Revit 2024 API
Category.Visible Property
 Retrieves or changes the visibility of the category in the active view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool this[
	View view
] { get; set; }
Visual Basic
Public Property Visible ( _
	view As View _
) As Boolean
	Get
	Set
Visual C++
public:
property bool Visible[View^ view] {
	bool get (View^ view);
	void set (View^ view, bool value);
}
Parameters
view
Type: Autodesk.Revit.DB.View
Remarks
This affects only if the category is set visible or invisible individually. Other Revit mechanisms may also affect the visibility of elements of this category, including:
the category classes settings for model categories, annotation categories, import categories or analytical model categories.
view filters
 Thus setting this value may not affect the actual visibility of elements of this category in the view.
See Also
Category Class
Autodesk.Revit.DB Namespace